Write a solution to report the first name, last name, city, and state of each person in the Person table. If the address of a personId is not present in the Address table, report null instead.

Return the result table in any order.

The result format is in the following example.

In [124]:
import pandas as pd

In [125]:
data = [[1, 'Wang', 'Allen'], [2, 'Alice', 'Bob']]
person = pd.DataFrame(data, columns=['personId', 'firstName', 'lastName']).astype({'personId':'Int64', 'firstName':'object', 'lastName':'object'})
person

   personId firstName lastName
0         1      Wang    Allen
1         2     Alice      Bob

In [126]:
data = [[1, 2, 'New York City', 'New York'], [2, 3, 'Leetcode', 'California']]
address = pd.DataFrame(data, columns=['addressId', 'personId', 'city', 'state']).astype({'addressId':'Int64', 'personId':'Int64', 'city':'object', 'state':'object'})
address

   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

In [127]:
n = person.merge(address, how="left")
n[["firstName", "lastName", "city", "state"]]

  firstName lastName           city     state
0      Wang    Allen            NaN       NaN
1     Alice      Bob  New York City  New York

Write a solution to find the employees who earn more than their managers.

Return the result table in any order.

The result format is in the following example.

In [128]:
data = [[1, 'Joe', 70000, 3], [2, 'Henry', 80000, 4], [3, 'Sam', 60000, None], [4, 'Max', 90000, None]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'managerId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'managerId':'Int64'})
employee

   id   name  salary  managerId
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000       <NA>
3   4    Max   90000       <NA>

In [130]:
emp = pd.merge(employee, employee, left_on="id", right_on="managerId", suffixes=["_manager", "_employee"])
r = emp.query("salary_employee > salary_manager")["name_employee"]
s = pd.DataFrame(r)
s = s.rename(columns={"name_employee": "Employee"})
s

  Employee
0      Joe